var album = [
            {
                pic:"qrc:/res/h_0.png",
                title: qsTr("年度Music放不停"),
                singer:"Toou 收集",
                date:"2019-01-05"
            },
            {
                pic:"qrc:/res/h_1.png",
                title:"曼威经典改版DJ",
                singer:"Toou 收集",
                date:"2019-02-06"
            },
            {
                pic:"qrc:/res/h_2.png",
                title:"嘘，静心慢慢听不完",
                singer:"Toou 收集",
                date:"2019-03-07"
            },
            {
                pic:"qrc:/res/h_3.png",
                title:"懂你的欧美每日推荐",
                singer:"Toou 收集",
                date:"2019-04-08"
            },
            {
                pic:"qrc:/res/h_4.png",
                title:"绝美人声＋电音撩人美声",
                singer:"Toou 收集",
                date:"2019-05-09"
            }

        ]

var mv = [
            {
                pic:"qrc:/res/ms_0.png",
                title:"今年夏天认真听过的歌曲",
            },
            {
                pic:"qrc:/res/ms_1.png",
                title:"小花自作曲上线，清新脱俗",
            },
            {
                pic:"qrc:/res/ms_2.png",
                title:"伤感女王演绎经典曲目",
            },
            {
                pic:"qrc:/res/ms_3.png",
                title:"可惜不是你，陪我到最后",
            },

        ]


var music = [
            {
                pic:"qrc:/res/s0.png",
                name:"公子向北走",
                album:"公子向北走",
                singer:"霈丹（浪哥）",
                intro:"2019-02-20发行 Pop 流行",
                duration:"04:07",
                lrc:"qrc:/database/gzxbz.lrc"
            },
            {
                pic:"qrc:/res/s1.png",
                name:"十年",
                album:"黑白灰",
                singer:"陈奕迅",
                intro:"2001-03-29发行 Pop 流行",
                duration:"05:06",
                lrc:"qrc:/database/gzxbz.lrc"
            },
            {
                pic:"qrc:/res/s2.png",
                name:"纸短情长(Cover 烟把乐队)",
                album:"纸短情长",
                singer:"刘艺佳",
                intro:"2018-05-10发行 Pop 流行",
                duration:"04:00",
                lrc:"qrc:/database/gzxbz.lrc"
            },
            {
                pic:"qrc:/res/s3.png",
                name:"哎呀呀",
                album:"同真同趣",
                singer:"小爱与花儿乐队",
                intro:"2018-06-19发行 Pop 流行",
                duration:"02:56",
                lrc:"qrc:/database/gzxbz.lrc"
            },
            {
                pic:"qrc:/res/s4.png",
                name:"不仅仅是喜欢",
                album:"萧傲江湖Ⅱ",
                singer:"孙语赛",
                intro:"2019-03-06发行 Pop 流行",
                duration:"03:48",
                lrc:"qrc:/database/gzxbz.lrc"
            },
            {
                pic:"qrc:/res/s5.png",
                name:"平凡之路",
                album:"猎户星座",
                singer:"朴树",
                intro:"2017-08-12发行 Pop 流行",
                duration:"05:02",
                lrc:"qrc:/database/gzxbz.lrc"
            },
            {
                pic:"qrc:/res/s6.png",
                name:"活着",
                singer:"郝云",
                album:"活着",
                intro:"2015-01-18发行 Pop 流行",
                duration:"04:31",
                lrc:"qrc:/database/gzxbz.lrc"
            },
            {
                pic:"qrc:/res/s7.png",
                name:"可惜不是你",
                album:"丝路",
                singer:"梁静茹",
                intro:"2005-09-16发行 Pop 流行",
                duration:"04:45",
                lrc:"qrc:/database/gzxbz.lrc"
            },
            {
                pic:"qrc:/res/s8.png",
                name:"Rolling In The Deep",
                album:"Rolling In The Deep",
                singer:"Adele",
                intro:"2011-01-24发行 Pop 流行",
                duration:"03:48",
                lrc:"qrc:/database/gzxbz.lrc"
            },
            {
                pic:"qrc:/res/s9.png",
                name:"2018歌曲串烧",
                album:"全年精典",
                singer:"沈虫虫/吕口口",
                intro:"2018-06-31发行 Pop 流行",
                duration:"02:59",
                lrc:"qrc:/database/gzxbz.lrc"
            },
            {
                pic:"qrc:/res/s10.png",
                name:"Move Your Body (Alan Walker Remix)",
                album:"Move youer body",
                singer:"Sia",
                intro:"2019-02-20发行 Pop 流行",
                duration:"03:38",
                lrc:"qrc:/database/gzxbz.lrc"
            }
        ]


var singer = [
            {
                pic:"qrc:/res/adele.png",
                name:"Adele",
                sname:"阿黛尔",
                info:"爱黛尔·萝丽·布鲁·艾金斯，MBE（Adele Laurie Blue Adkins，1988年5月5日－），是一位英国创作歌手及多重乐器演奏者。Adele生于英国Tottenham，自幼受爵士乐薰陶，如Ella Fitzgerald和Etta Jame都是她陪伴她成长的“音乐老师”。早在14岁便已开始作曲，及后毕业于著名表演艺术学府BRIT School，亦即于Kate Nash、Amy Winehouse和Katie Melua等人份属校友。毕业后曾跟随不少音乐人作巡演乐手，如Jamie T、Amos Lee和Keren Ann等。07年底分别推出了两张细碟《Hometown Glory》和《Chasing Pavements》，直至2008年1月底首张专辑《19》才上市。"
            },
            {
                pic:"qrc:/res/chl.png",
                name:"陈慧琳",
                sname:"Kelly Chen",
                info:"陈慧琳，香港著名女歌手及演员，1995年加入香港乐坛，并成为大中华区流行乐坛90年代中期仅有的天后级歌手之一她曾推出多张广受乐迷欢迎的专辑，由 1999年尾更带起华语乐坛电音热潮，得到“电音女王”及“广告天后”之称，更被喻为香港乐坛的“最后一个天后”，是公认亚洲最成功的女艺人之一，其杰出成就倍受国际肯定。其中《恋爱情色》《花花宇宙/不得了》《失忆周末/不如跳舞》《大日子/好地方》等歌曲深入民心，计她的个人专辑总销量早已超过一千多万张。"
            },
            {
                pic:"qrc:/res/cj.png",
                name:"崔健",
                sname:"Jian Chua",
                info:"中国大陆著名摇滚歌手，音乐人。被誉为中国摇滚乐开山之人，有“中国摇滚教父”之称。出生北京东郊幸福村的一个朝鲜族家庭,很快就被一个有音乐和舞蹈的环境包围了。他的父亲是个专业的小号演奏者，母亲是朝鲜族舞蹈团的成员。崔健14岁时开始学习吹小号，20岁时，崔健成为知名的北京爱和管弦乐团专业小号手。1987年，崔健正式离开北京交响乐团，他开始为ADO工作。在ADO的帮助下，崔健发行了他自己认为是第一张的专辑--《新长征路上的摇滚》。专辑《解决》当中的一首《快让我在雪地上撒点野》被制作成MTV，并得到国际MTV大奖，迅速在亚洲流行。同年，崔健第一次在东京演出。2004年9月26日，崔健在美国旧金山接受了“世界和平音乐大奖”。"
            },
            {
                pic:"qrc:/res/cjy.png",
                name:"蔡健雅",
                sname:"Tanya Chua",
                info:"新加坡人，华语著名歌手、词曲作者，音乐制作人。1997年在新加坡由其经纪公司 Music & Movement 旗下的Yellow Music发行英语专辑《Bored》而正式出道，1999年将国语唱片签约于宝丽金唱片旗下，并推出首张国语同名专辑《蔡健雅》。2000年因宝丽金唱片并入环球唱片旗下，因此《记念》及之后的唱片皆由台湾环球唱片发行。在此一专辑中，蔡健雅以〈记念〉一曲成功打响在台湾市场的知名度。同年入围台湾第11届金曲奖最佳新人奖。2002年发行《Secret Lavender》专辑。同年以〈打错了〉作曲者身份入围台湾第13届金曲奖最佳作曲人奖，并同时入围最佳国语演唱人奖。2004年首度担任制作人，替梁咏琪制作《归属感》专辑。同年以《陌生人》获得台湾第15届金曲奖最佳国语女演唱人提名。2008年推出专辑《My Space》，同年获台湾第19届金曲奖7项提名，并获得了最佳专辑制作人和最佳国语女歌手两座大奖。近年移居台湾。2012年获最佳国语女歌手奖。代表作品：《呼吸》《陌生人》《空白格》《若你碰到他》《红色高跟鞋》。"
            },
            {
                pic:"qrc:/res/clean_bandit.png",
                name:"Clean Bandit",
                sname:"清洁盗贼",
                info:"清洁盗贼（Clean Bandit）是一个来自英国的电子乐乐队，2009年成立于英国剑桥。他们凭借2014发行的单曲《Rather Be》被人们所熟知。 Clean Bandit是一支英国电子乐队，成立于2009年，成员有Jack Patterson, Grace Chatto, Milan Neil Amin-Smith 和 Ssegawa-Ssekintu Kiwanuka。他们的音乐被称为“融合”音乐，混合了电子音乐和古典音乐。他们自己创作音乐然后邀请其他艺人来演唱他们的歌曲。乐队的名字Clean Bandit来源于一个俄罗斯选育，意思大概是“彻头彻尾的混蛋”。 2014年1月，Clean Bandit的单曲《Rather Be》首周夺冠，2月，Clean Bandit的单曲《Rather Be》连续第三周领跑英国单曲榜。 2015年2月，Clean Bandit与Jess Glynne合作的《Rather Be》获得最佳舞曲录音奖，8月，英国Camp Bestival音乐节，Clean Bandit参与演出。"
            },
            {
                pic:"qrc:/res/cyl.png",
                name:"蔡依林",
                sname:"Jolin Tsai",
                info:"中国台湾著名流行女歌手。1999年在台湾地区出道，被媒体冠以“少男杀手”称号，于7月份推出了第一支个人单曲EP《和世界做邻居》，9月正式推出首张国语专辑《Jolin 1019》，知名度迅速上升，获得大量人气。当时与孙燕姿、萧亚轩、梁静茹并称台湾四小天后。2003年3月，推出转型作品《看我72变》专辑，获得巨大成功。2007年受颁第十八届台湾金曲奖最佳国语女演唱人。2008年，《Love Love Love》在中国北京奥运会赛场的强力播送下空降荷兰X-Tips单曲榜冠军，并打破历史指数纪录，成为首位夺冠的亚洲歌手。后被法国杂志《亚洲音乐》评选为十位亚洲最佳女歌手之一，且是唯一一位华人歌手。蔡依林出道至今多次担任唱片的歌词创作，参与演唱会策划及MV制作。代表作品：《说爱你》、《看我72变》、《爱情36计》、《大艺术家》、《舞娘》、《日不落》、《美人计》。"
            },
            {
                pic:"qrc:/res/cyx.png",
                name:"陈奕迅",
                sname:"Eason Chan",
                info:"著名实力派粤语流行音乐歌手、演员，香港演艺人协会副会长之一，曾被美国《时代杂志》形容为影响香港乐坛风格的人物，同时也是继许冠杰、张学友之后第三个获得“歌神”称号的香港男歌手。同时他也是继张学友后另一个在台湾获得成功的香港歌手，在2003年他成为了第二个拿到台湾金曲奖“最佳国语男演唱人”的香港歌手。陈奕迅曾被《时代》杂志形容为影响香港乐坛风格的人物。2010年，陈奕迅入选全球华人音乐殿堂华语金曲奖“30年经典评选”，成为1990年代出道歌手唯一代表。陈奕迅曾在多个亚太地区获得多个奖项和提名，包括香港地区的“叱咤乐坛男歌手金奖”、“叱咤乐坛我最喜爱的男歌手奖”、“十大劲歌金曲最受欢迎男歌星奖”。代表作品：《爱情转移》、《十年》、《浮夸》、《K歌之王》。"
            },
            {
                pic:"qrc:/res/dlj.png",
                name:"邓丽君",
                sname:"Teresa Teng",
                info:"台湾著名女歌手。邓丽君自14岁步入歌坛以后，逐步凭借精湛的歌艺，高贵的形象和坚韧的性格享誉华人世界和日本社会，影响范围覆盖亚洲众多地区，最终成为20世纪歌坛中一颗璀璨的巨星。成为首位登上美国纽约林肯中心、洛杉矶音乐中心、拉斯维加斯凯撒皇宫的华人女歌手。1986年获选美国《时代杂志》“世界七大女歌星”和“世界十大最受欢迎女歌星”之一，成为唯一一位同时获得两项殊荣的亚洲歌手。1995年，邓丽君因气喘突发，猝逝泰国清迈，享年42岁。时至今日，仍有无数歌手翻唱她的经典歌曲向其致敬。代表作品：《我只在乎你》《甜蜜蜜》《 月亮代表我的心》《漫步人生路》《空港》。"
            },
            {
                pic:"qrc:/res/fir.png",
                name:"F.I.R.",
                sname:"飞儿乐团",
                info:"飞儿乐团（F.I.R.），台湾一女二男乐团，由著名音乐制作人陈建宁老师一手创立，团员包含创作吉他手 阿沁（黄汉青）、主唱Lydia 组成。 2002年5月，飞儿乐团正式成立，音乐内容多元，涵盖Folk Rock、Rock、Jazz、雷鬼等曲风。飞儿乐团的创作制作几乎全都出自陈建宁与阿沁笔下，概念性强，理念表达具深度且完整，音乐风格非常国际化，多年来屡屡远赴英国、美国、日本世界各地与幕后音乐人合作，从旋律的市场性，编曲的丰富直到歌词的内涵，专辑听下来层次分明，张力十足 。两位成员除了自身专辑全创作制作，也替无数天王天后诸如张惠妹、萧敬腾、张学友、张韶涵、蔡依林、陈奕迅、孙燕姿、蔡健雅....等创作制作专辑，累积合作超过300位歌手，F.I.R.堪称华语最强的音乐创作品牌，团长陈建宁更历任华纳唱片、SONY 音乐等国际唱片公司音乐总监，吉他手阿沁致力于各大专院校音乐教育，F.I.R.在音乐圈幕前幕后都十分活跃，不断打造出许多经典作品。"
            },
            {
                pic:"qrc:/res/gzs.png",
                name:"葛仲珊",
                sname:"MISS KO",
                info:"葛仲珊 （英文名：MISS KO，1985年9月5日－），出生于美国纽约的皇后区，是一位将英文和中文饶舌融合在一起的创作者，自高中时期开始写歌词，并就读Five Towns College，大学时也与日本说唱团等人合作，毕业后在纽约大学商学院攻读研究所，但是热爱音乐的她毅然决然决定休学实现音乐梦想。"
            },
            {
                pic:"qrc:/res/halsey.png",
                name:"Halsey",
                sname:"Ghost Halsey",
                info:"1994年9月29日出生于美国新泽西州华盛顿市，美国创作型歌手。2014年7月，与Astralwerks唱片签约，并发布首支个人单曲《Ghost》；10月27日，发行首张迷你专辑《Room 93》 。2015年8月28日，推出首张录音室专辑《Badlands》。2016年7月29日，发行与烟鬼组合合作的单曲《Closer》，歌曲在美国公告牌百强单曲榜取得了连续12周冠军的成绩；12月9日，获得第11届公告牌年度女性奖“最具突破新人”（明日之星）奖。2017年2月10日，为电影《五十度黑》献唱的插曲《Not Afraid Anymore》发行；2月12日，凭借《Closer》获得第59届格莱美奖“最佳流行组合/合作”提名。2017年6月2日发布第二张录音室专辑《hopeless fountain kingdom》"
            },
            {
                pic:"qrc:/res/hy.png",
                name:"郝云",
                sname:"Yun Hao",
                info:"2008年签约环球音乐集团，同年3月发表了第一张个人原创专辑《郝云北京》,2010年8月发表了第二张个人原创专辑《突然想到理想这个词》，并获得2010年MusicRadio中国TOP排行榜内地最佳创作歌手奖,2013年签约巨匠娱乐公司于9月发表第三张个人原创专辑《活着》，并获得MusicRadio中国TOP排行榜13年度最佳创作男歌手奖以及“第21届东方风云榜”最佳创作歌手奖"
            },
            {
                pic:"qrc:/res/hz.png",
                name:"花粥",
                sname:"Hua Hua",
                info:"大学专业：机电工程学院2012年独自异军突起的“清新”派民谣歌手，来自新疆，就读于长沙某高校的普通大学生。在同学们着迷流行音乐，花枝招展的勾搭小伙子时，花粥已经抱着一把杂牌吉他创造了中国民谣歌手的诸多新纪录。"
            },
            {
                pic:"qrc:/res/ljj.png",
                name:"林俊杰",
                sname:"JJ Lin",
                info:"著名男歌手，作曲人、作词人、音乐制作人，偶像与实力兼具。林俊杰出生于新加坡的一个音乐世家。在父母的引导下，4岁就开始学习古典钢琴，不善言辞的他由此发现了另一种与人沟通的语言。小时候的林俊杰把哥哥林俊峰当作偶像，跟随哥哥的步伐做任何事，直到接触流行音乐后，便爱上创作这一条路。2003年以专辑《乐行者》出道，2004年一曲《江南》红遍两岸三地，凭借其健康的形象，迷人的声线，出众的唱功，卓越的才华，迅速成为华语流行乐坛的领军人物之一，迄今为止共创作数百首音乐作品，唱片销量在全亚洲逾1000万张。2007年成立个人音乐制作公司JFJ，2008创立潮流品牌SMG。2011年被媒体封为“新四大天王”之一，同年8月8日正式加盟华纳音乐，开启事业新乐章。2012年发行故事影像书《记得》，成功跻身畅销书作家行列。获得多项奖项：第15届台湾金曲奖最佳新人奖，6届新加坡金曲奖大奖，6届新加坡词曲版权协会大奖，8届全球华语歌曲排行榜大奖，5届MusicRadio中国TOP排行榜大奖。"
            },
            {
                pic:"qrc:/res/ftm.png",
                name:"冯提莫",
                sname:"Chengcheng Feng",
                info:"冯提莫，英文名Ti mo Feng ，祖籍重庆。 因在线玩LOL，一个偶然的机会下用10块钱的耳机麦给观众唱了几首歌，然后人气开始旺起来了，在网上直播间走红，直播风格搞笑卖萌。 在网易云音乐，冯提莫作为主播电台的翘楚，单期节目在线播放达到1000万以上的翻唱单曲达到40首以上之多，数期节目的评论量也多达万条以上。 2017年6月30日冯提莫首支个人单曲《识食物者为俊杰》，在网易云音乐独家首发。"
            },
            {
                pic:"qrc:/res/ljr.png",
                name:"梁静茹",
                sname:"Fish Leong",
                info:"华语著名女歌手，马来西亚人。被称为“情歌天后”。梁静茹出生在马来西亚，来台湾前得过许多歌唱比赛奖项。在一次歌唱比赛中有幸得到李宗盛肯定，并带其进入滚石唱片。于1999年9月发行自己的第一张个人专辑《一夜长大》。2000年发行的《勇气》则几乎令她一夜成名。2004年《燕尾蝶》发行，这是梁静茹的转型大碟，专辑中尝试是摇滚曲风，把梁静茹的独特嗓音发挥到极致，也获得了众多好评。2005年的《可惜不是你》在其演绎下生动感人、催人泪下，有着很高的知名度和传唱度。代表作品：《勇气》、《分手快乐》、《宁夏》、《丝路》、《暖暖》、《崇拜》、《情歌》、《爱久见人心》。"
            },
            {
                pic:"qrc:/res/lyj.png",
                name:"刘艺佳",
                sname:"Yijia Liu",
                info:"刘艺佳，女，生于内蒙古锡林浩特 自由音乐人 微博：刘艺佳L"
            },
            {
                pic:"qrc:/res/lzx.png",
                name:"林志炫",
                sname:"Terry Lin",
                info:"前优客李林成员，以流畅的真假音转换以及高亢、优美的歌声著称。至今已多次入围金曲奖，是著名的实力派歌手，96年其天籁美声受伦敦交响乐团之青睐，成为第一个与国际著名乐团合作的中国歌手；98年《蒙娜丽莎的眼泪》专辑赴美录音时，受到曾为席琳迪翁等国际天后制作专辑的金牌制作人东尼史密斯盛赞其为“任何语言领域最棒的歌手”。近几年，他对于自己的音乐提出了更高的要求，成为“One take”录制理念的倡导者，提倡用现场演唱的方式将歌曲一次诠释到位，直接录制成专辑，在科技变造时代难能可贵。曾有人把林志炫、齐豫、蔡琴并列为台湾最漂亮的三把嗓子，这实在得益于他独特的声线。"
            },
            {
                pic:"qrc:/res/lg.png",
                name:"霈丹（浪哥）",
                sname:"Signum",
                info:"浪哥最新单曲《写给黄淮》；黄淮可能是一个人，也可能是一个地方，也可能是心中的某种寄托。可爱而不可得，遗憾又或者怀念下的依恋。以患得患失的梦为食物，以可有可无的人做食客，配上牵肠挂肚的酒。别再问我黄淮是谁，是你心中最柔软的地方。"
            },
            {
                pic:"qrc:/res/ps.png",
                name:"朴树",
                sname:"Shu Pu",
                info:"中国大陆歌手，音乐人。1996年10月正式成为“麦田音乐”签约歌手，为简略笔划而定艺名朴树。首支单曲《火车开往冬天》，96年底推出后成绩斐然。99年1月，推出首张个人专辑《我去两千年》。99年12月与华纳唱片正式签订唱片合约，成为其亚太区旗下的第一位内地歌手，其首张专辑《我去两千年》将由华纳重新混录和拍摄最新单曲录影带后，于2000年上半年在海外隆重上市。代表作品：《那些花儿》，《白桦林》，《生如夏花》。主要成就：中歌榜最佳新人奖，最受欢迎男歌手，年度最佳制作人奖"
            },
            {
                pic:"qrc:/res/nz.png",
                name:"那英",
                sname:"Na na na Ynnn",
                info:"中国著名女歌手。华语乐坛90年代首屈一指的实力派天后，多次在央视春晚演唱歌曲，出演过多部影视剧。1988年，对那英来说是意义重大的一年，那一年在“阳光杯青年歌手大赛”中，那英凭着苏芮的《一样的月光》和《我找到自己》获得了第三名。1993年：再度荣获全国十大最受欢迎歌手奖；4月，签约福茂唱片。1994年：出版首张个人专辑《为你朝思暮想》；1995年：出版第二张个人专辑《白天不懂夜的黑》。1998年：1月，中国中央电视台春节联欢晚会与王菲合唱《相约'98》；4月，出版个人第三张专辑《征服》	，至此，那英迅速积累了人气。一曲《征服》更是红遍大江南北。2001年，凭借专辑《心酸的浪漫》成为迄今唯一获得台湾金曲奖最佳国语女歌手奖的内地歌手。代表作品：《征服》《心酸的浪漫》《一笑而过》《那又怎样》。"
            },
            {
                pic:"qrc:/res/pwb.png",
                name:"潘玮柏",
                sname:"Will Pan； Wilber Pan",
                info:"美籍华人，中国台湾流行歌手、演员。2002年底发行首张专辑《壁虎漫步》后步入歌坛。2005年与大陆女歌手弦子合作《不得不爱》红遍两岸三地。其后缔造出《高手》《零零七》等八张畅销专辑成为歌影视界的实力偶像全能艺人，在华语乐坛人气鼎旺。2009年更升级潮店老板，所开设的NPC潮流服饰店在上海、北京均有店铺。2011年跨界软件行业，担任卡米果公司游戏创意总监设计了下载量第一的“熊猫屁王”游戏，成为中国演艺界第一个成功跨足软件业的艺人，同年主演的《爱∞无限》获得第46届台湾金钟奖最佳男主角。至今其唱片全亚洲总销量已逾600万张。2012年8月31日发布新专辑《24个比利》。2013年宣布举办“释放自己”世界巡回演唱会。"
            },
            {
                pic:"qrc:/res/scc.png",
                name:"沈虫虫/吕口口",
                sname:"SCC LKK",
                info:"大家好！我是沈虫虫！我是一个在美国留学的大三学生。平时喜欢翻唱 搞混搭改编歌曲！代表作《高考版演员》《英文版李白》《一人我饮酒醉改编版》等. 希望大家能喜欢我的歌！微博：沈虫虫"
            },
            {
                pic:"qrc:/res/sia.png",
                name:"Sia",
                sname:"希雅·富勒",
                info:"SiA，全名Sia Kate Isobelle Furler.生于1975年12月18日，澳大利亚。父母均从事音乐工作，I only owned 2 CDs: a Jackson 5 anthology and Jeff Buckley's Grace. SiA在真正从事音乐之前，她听的音乐真的很少很少。因为在和Zero 7一起巡回演出之后，SiA才非常认真的去听各种不同的音乐作品。"
            },
            {
                pic:"qrc:/res/sys.png",
                name:"孙语赛",
                sname:"Siali Sun",
                info:"孙语赛,华语内地女歌手，代表作《不仅仅是喜欢》《你潇洒我漂亮》《戒不掉》《可不可以让我对你好》"
            },
            {
                pic:"qrc:/res/wf.png",
                name:"王菲",
                sname:"王靖雯； Faye Wong",
                info:"致青春、 因为爱情、 传奇、 红豆、 容易受伤的女人、 红豆、 催眠、 流年、 我愿意、 人间、 闷、 百年孤寂等。"
            },
            {
                pic:"qrc:/res/xayhe.png",
                name:"小爱与花儿乐队",
                sname:"flower and love",
                info:"小爱与花儿乐队是由前花儿乐队成员鼓手王文博、贝斯手郭阳与90后混血美女小爱正式重组为新花儿乐队，神秘新主唱小爱成为媒体关注的焦点，人气突长被网友们成为“曙光女神” ，乐队代表作品《曙光》。 新花儿乐队前身是由主唱大张伟、鼓手王文博、贝斯手郭阳组成的花儿乐队，1999年乐队正式出道，经历的10年风雨于2009年解散，乐队代表作品《化蝶飞》《嘻唰唰》《我们能不能不分手》。"
            },
            {
                pic:"qrc:/res/zhm.png",
                name:"张惠妹",
                sname:"aMEI； 阿密特",
                info:"中国台湾著名女歌手，亚洲流行歌坛重量级天后，台湾原住民歌手。张惠妹于华人世界名气极高，于海外（尤美、日等地）也有一定的知名度，已囊括多项华语圈重要的音乐奖项。也是台湾首位接受美国CNN专访的歌手（并且在2011年第二度接受此媒体《Talk Asia》节目专访）。阿妹在1996年三月被著名台湾音乐人陈志远、陈复明发现并签约丰华唱片。并在同年7月在带自己入行的恩师张雨生的《两伊战争－红色热情》专辑中与张雨生男女对唱《最爱的人伤我最深》。同年12月13日，张惠妹在张雨生的协助下发行第一张个人专辑《姐妹》。1998年 举办第一场个人大型户外售票演唱会“妹力四射”，创下台湾歌手有史以来最快举行大型演唱会的纪录。2009年发行的《阿密特》专辑至今仍是金曲奖史上获得最大成功的作品，曾于第21届时擒下包括专辑、制作人、歌手等六项大奖。代表作品：《姐妹》、《我可以抱你吗》、《记得》、《火》、《如果你也听说》、《掉了》、《我最亲爱的》。"
            },
            {
                pic:"qrc:/res/zzy.png",
                name:"张震岳",
                sname:"阿岳； Chang Csun Yuk",
                info:"著名歌手，张震岳出生于宜兰县苏澳镇，为台湾原住民阿美族人。小时候因为参加教会唱诗班的缘故，开始对音乐产生兴趣，接着在国中时学习弹奏吉他。中学时期，他开始听BONJOVI、SPEEDMETAL等西洋摇滚，国语则深受陈升自由随性的曲风影响，融合两者就是张震岳今天充满摇滚、白话的“岳式风格”的主要特色。张震岳在高中开始接触摇滚乐。1993年12月发行第一张专辑《就是喜欢你》。之后张震岳也曾以“DJ Orange”为名在2001年4月和7月发行了两张电子音乐专辑，分别为《ORANGE》和《ORANGE2》。2008年8月，张震岳曾和知名歌手罗大佑、李宗盛、周华健组成乐团纵贯线。"
            },
            {
                pic:"qrc:/res/zjl.png",
                name:"周杰伦",
                sname:"Jay Chou",
                info:"著名歌手，音乐人，词曲创作人，编曲及制作人，MV及电影导演。新世纪华语歌坛领军人物，中国风歌曲始祖，被时代周刊誉为“亚洲猫王”，是2000年后亚洲流行乐坛最具革命性与指标性的创作歌手，亚洲销量超过3100万张，有“亚洲流行天王”之称，开启华语乐坛“R&B时代”与“流行乐中国风”的先河，周杰伦的出现打破了亚洲流行乐坛长年停滞不前的局面，为亚洲流行乐坛翻开了新的一页，是华语乐坛真正把R&B提升到主流高度的人物，引领华语乐坛革命整十年，改写了华语乐坛的流行方向。"
            }

        ]


var comments = [
            {
                user:"悦儿的夏天",
                date:"2018-07-01",
                ctext:"想到了那句Crazy English ",

            },
            {
                user:"bai枫之恋",
                date:"2018-08-12",
                ctext:"你永远都不会知道 你在路上随便见到的路人甲 是别人做梦都想见到的人",

            },
            {
                user:"爱打你脸",
                date:"2018-08-31",
                ctext:"愿你日子清静 抬头遇见的都是柔情",

            },
            {
                user:"风兮丨上弦",
                date:"2019-08-01",
                ctext:"我与春风皆过客 你携秋水揽星河",

            },
            {
                user:"不得不爱才怪",
                date:"2019-08-02",
                ctext:"想写给她情话 可我没有话 也没有她",

            },
            {
                user:"亦真亦甲sky",
                date:"2019-08-03",
                ctext:"我看着这首歌的评论从497到704，只用了一个小时",

            },
            {
                user:"1993a11",
                date:"2019-08-04",
                ctext:"我也是这样，磕了桌角，后来青紫。最先离开，最后心痛",

            },
            {
                user:"panyaou",
                date:"2019-08-05",
                ctext:"是啊，甚至无比嫉妒和他一个班级的人",

            },
            {
                user:"等不到的晴天",
                date:"2019-08-06",
                ctext:"人都是后知后觉 就此别过吧",

            },
            {
                user:"偷撷",
                date:"2019-08-07",
                ctext:"认识就够了，余生就算了。 以前打扰了，以后不会了。",

            },
            {
                user:"殇敷逆",
                date:"2019-08-08",
                ctext:"我与春风皆过客 你携秋水揽星河",

            },
            {
                user:"逍遥坚坚",
                date:"2019-08-09",
                ctext:"封面不会是犬夜叉和桔梗的同人吧？",

            },
            {
                user:"欧铭凝",
                date:"2019-08-22",
                ctext:"前奏如果没有男人的声音哎呀呀，评论早9999了",

            },
            {
                user:"刀剑侠客梦",
                date:"2019-08-23",
                ctext:"换一下封面 在最喜欢的晚上听见这首歌 超级有感觉 然后 打开封面 手机给吓掉了 求轻喷",

            },

            {
                user:"骗玩家很在行",
                date:"2019-08-24",
                ctext:"“我喜欢你” “你是在玩真心话大冒险吗？” “是啊” “那你选的大冒险咯” “不，我选的真心话”",

            },

            {
                user:"小孩子",
                date:"2019-08-25",
                ctext:"我要趁你心里一软 捏成爱我的形状.",

            },

            {
                user:"香香香草奶昔",
                date:"2019-08-06",
                ctext:"再好听也不要在别人哪里评价好好听歌就好了呀",

            },

            {
                user:"celtic",
                date:"2019-08-27",
                ctext:"我就纳闷了为啥搜索排前面的是听出一股做作的味道赶紧换了听这版",

            },

            {
                user:"浪小贱Cc",
                date:"2019-09-22",
                ctext:"不喜欢就直说嘛，还说啥:“你喜欢女的我喜欢男的，咱两爱好不一样不合适”",

            },

            {
                user:"世贤很清醒",
                date:"2019-08-01",
                ctext:"高考前一天的晚上，我们骑着自行车去公园玩，我为她唱了这首歌",

            },

            {
                user:"风雪夜归人lily",
                date:"2019-08-02",
                ctext:"她也许不知道，可能永远不会知道，总之，谢谢你出现在我的生活，希望你前程一切顺利",

            },

            {
                user:"海水真咸",
                date:"2019-08-03",
                ctext:"然后，我们就这样在高三最后的一个月渐行渐远，很久没她的消息了，如果我还能遇到她，我会说:滚",

            },

            {
                user:"百度智能云",
                date:"2019-08-05",
                ctext:"愿得一人心，白首不分离！！！晓看天色，暮看云，行也思君，坐也思君 刘高雯我真的很爱很爱你",

            },
            {
                user:"骑车好健康",
                date:"2019-08-06",
                ctext:"死生契阔，与子成说。执子之手，与子偕老",

            },

            {
                user:"北乔南",
                date:"2019-08-07",
                ctext:"我想谈一场公开的恋情 爸妈同意 亲戚知道 朋友祝福的恋爱",

            },
            {
                user:"昨天晚上偷冬瓜",
                date:"2019-08-08",
                ctext:"相信我大兄弟，用了网易云才是开始！",

            },
            {
                user:"利杂浩",
                date:"2019-08-09",
                ctext:"老天给了你一张混社会的脸，你却在这唱情歌",

            },
            {
                user:"那年那月那脸",
                date:"2019-08-11",
                ctext:"你若为星辰，我愿做宇宙，感受你独特的光",

            },
            {
                user:"三九太郎",
                date:"2019-08-12",
                ctext:"这要是拍成短片肯定敲好看",

            },
            {
                user:"骑蜗牛上高速",
                date:"2019-08-25",
                ctext:"我相信一直善良下去，总会更靠近幸福。",

            },
            {
                user:"航迹云",
                date:"2019-08-15",
                ctext:"这首歌已经收到了， 作为一名粉丝 我希望你 以后会越来越好 我会默默支持你的",

            },
        ]
